In [37]:
import numpy as np
import pandas as pd
import random

lista_nomi = ['Paperino','Pippo','Pluto', 'Giovanni', 'Marco']
lista_citta = ['Milano','Napoli','Agrate Brianza','Roma','Torino']

n = 30

nomi_casuali = random.choices(lista_nomi, k=n)
citta_casuali = random.choices(lista_citta, k=n)
salari = np.random.randint(20,100,size = n - 1)
eta = np.random.randint(0,120, size = n)
salari_nan = np.append(salari , np.nan)

df = pd.DataFrame({
    'Nome': nomi_casuali,
    'Città': citta_casuali,
    'Salario in K': salari_nan,
    'Età': eta
})

In [40]:
print(df.head())
print(df.tail())

       Nome           Città  Salario in K  Età
0     Marco          Milano          88.0  114
1  Paperino  Agrate Brianza          86.0   14
2  Giovanni          Napoli          97.0   81
3  Paperino            Roma          79.0    1
4     Pippo  Agrate Brianza          90.0   79
        Nome   Città  Salario in K  Età
25     Pippo  Torino          58.0   63
26     Pluto  Napoli          64.0   76
27     Pluto    Roma          32.0   93
28  Giovanni  Napoli          66.0   68
29     Pluto  Napoli           NaN   17

In [41]:
df.dtypes

Nome             object
Città            object
Salario in K    float64
Età               int32
dtype: object

In [42]:
media_salario = df['Salario in K'].mean()
media_eta = df['Età'].mean()
mediana_salario = df['Salario in K'].median()
mediana_eta = df['Età'].median()
std_salario = df['Salario in K'].std()
std_eta = df['Età'].std()

print(media_salario,media_eta,mediana_salario,mediana_eta,std_salario,std_eta)

68.93103448275862 58.233333333333334 72.0 63.0 20.78792753100902 34.181748843834605

In [43]:
df_nuovo = df.drop_duplicates()
len(df_nuovo)

29

In [44]:
def categoria_eta(eta):
    if eta < 18:
        return 'Giovane'
    elif 18 <= eta < 66:
        return 'Adulto'
    else:
        return 'Senior'

df_nuovo['Categoria Età'] = df_nuovo['Età'].apply(categoria_eta)

In [47]:
df_nuovo['Salario in K'].fillna(df_nuovo['Salario in K'].median(), inplace= True)
df_nuovo

C:\Users\aless\AppData\Local\Temp\ipykernel_22212\4173331419.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_nuovo['Salario in K'].fillna(df_nuovo['Salario in K'].median(), inplace= True)
C:\Users\aless\AppData\Local\Temp\ipykernel_22212\4173331419.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_nuovo['Salario in K'].fillna(df_nuovo['Salario in K'].median(), inplace= True)

        Nome           Città  Salario in K  Età
0      Marco          Milano          88.0  114
1   Paperino  Agrate Brianza          86.0   14
2   Giovanni          Napoli          97.0   81
3   Paperino            Roma          79.0    1
4      Pippo  Agrate Brianza          90.0   79
6   Giovanni            Roma          63.0   95
7      Pippo            Roma          48.0   96
8      Pippo          Torino          82.0   96
9   Giovanni          Torino          54.0   35
10     Pluto  Agrate Brianza          73.0   50
11     Marco            Roma          79.0   12
12     Pippo            Roma          36.0   44
13     Marco          Napoli          20.0   63
14     Pluto            Roma          50.0   34
15  Giovanni            Roma          83.0   49
16     Pippo  Agrate Brianza          57.0   31
17  Giovanni            Roma          90.0   90
18     Marco          Torino          44.0   10
19     Pluto  Agrate Brianza          88.0   79
20  Giovanni  Agrate Brianza          90.0   89
21  Paperino          Torino          55.0   16
22  Giovanni          Torino          72.0    9
23  Giovanni          Milano          66.0   49
24     Pluto            Roma          99.0  115
25     Pippo          Torino          58.0   63
26     Pluto          Napoli          64.0   76
27     Pluto            Roma          32.0   93
28  Giovanni          Napoli          66.0   68
29     Pluto          Napoli          69.0   17

In [48]:
df_nuovo.to_csv('righe.csv', index=False)

In [49]:
df_nuovo.groupby('Città')['Salario in K'].mean()

Città
Agrate Brianza    80.666667
Milano            77.000000
Napoli            63.200000
Roma              65.900000
Torino            60.833333
Name: Salario in K, dtype: float64